Repository: jpdejavite/rtg_app
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Home
pt: Início

source: Recipes
pt: Receitas

source: New Recipe
pt: Nova Receita

source: Edit Recipe
pt: Editar Receita

source: New menu planning
pt: Novo planejamento de cardápio

source: Edit menu planning
pt: Editar planejamento de cardápio

# generic_error_save_menu_planning
source: An error occurred while saving menu planning
pt: Um erro aconteceu ao salvar o planejamento de cardápio

source: Start at
pt: Começa em

source: End at
pt: Termina em

source: add meal
pt: adicionar refeição

source: breakfast
pt: café da manhã

source: morgning snack
pt: lanche da manhã

source: lunch
pt: almoço

source: afternoon snack
pt: lanche da tarde

source: dinner
pt: jantar

source: supper
pt: ceia

source: cook
pt: cozinhar

source: left overs
pt: sobras

source: eat out
pt: comer fora

source: order food
pt: pedir comida

source: other
pt: outro

source: pick recipe
pt: escolher receita

source: write details
pt: escrever detalhe

# write_details_hint
source: write meal details
pt: escreva detalhes da refeição

source: Choose a Recipe
pt: Escolha uma Receita

source: Menu Planning History
pt: Histórico Planejamentos

# empty_menu_planning_list
source: No menu planning found
pt: Nenhum planejamento encontrada

source: Last used recipes
pt: Últimas receitas utilizadas

# other_recipes
source: Others recipes
pt: Outras receitas

# saving_menu_planning
source: Salving menu planning...
pt: Salvando de cardápio...

source: Edit Preparation Time
pt: Editar Tempo de Preparo

source: Recipe Details
pt: Detalhes Receita

source: Share recipe
pt: Compartilhar Receita

source: generate image
pt: gerar imagem

source: generate pdf
pt: gerar pdf

# app_name
source: Pomegranate
pt: Romã

# app_short_description
source: Recipes and groceries
pt: Receitas e listas de compras

# recipe_menu_planning
source: Planning Details
pt: Detalhes Planejamento

source: Serves
pt: Serve

source: person
pt: pessoa

source: people
pt: pessoas

# not_possible_to_show_recipe_details
source: An error occurred, it's not possible to show recipe details
pt: Um erro aconteceu, não é possível mostrar os detalhes da receita

source: Lists
pt: Listas

# empty_recipes_list
source: No recipes found
pt: Nenhuma receita encontrada

source: Order recipes
pt: Ordernar receitas

source: Filter by label
pt: Filtrar por etiqueta

# empty_grocery_list
source: No grocery list found
pt: Nenhuma lista encontrada

# type_in_to_filter_recipes
source: Type in to filter
pt: Digite para filtrar

source: General data
pt: Dados gerais

source: Recipe name
pt: Nome da receita

# type_in_3_chars
source: Type in at least 3 characters
pt: Digite pelo menos 3 caracteres

# type_in_10_chars
source: Type in at least 10 characters
pt: Digite pelo menos 10 caracteres

source: Source
pt: Fonte

source: Recipe copied from
pt: Receita copiada de

source: Label
pt: Etiqueta

source: Recipe label
pt: Etiqueta da receita

# servers_how_many_people
source: Serves how many people
pt: Serve quantas pessoas

source: Portions
pt: Porções

# preparation_time_in_minutes
source: Preparation time (minutes)
pt: Tempo de preparo (minutos)

source: Preparation time
pt: Tempo de preparo

source: Ingredients
pt: Ingredientes

source: Type in ingredient with quantity
pt: Digite o ingrediente com a quantidade

source: How to do
pt: Como fazer

# instructions_how_to_do_recipe
source: Instructions of how to do the recipe
pt: Instruções de como fazer a receita

source: Instructions
pt: Instruções

source: Fill a value greater than zero
pt: Preencha um valor maior que zero

# fill_a_valid_double
source: Fill a value greater than zero and with at most one dot
pt: Preencha um valor maior que zero e com no máximo uma virgula

# generic_error_save_recipe
source: An error occurred while saving recipe
pt: Um erro aconteceu ao salvar receita

source: Saved recipe
pt: Receita salva

# saved_menu_planning
source: Saved planning
pt: Planejamento salvo

# saving_recipe
source: Salving recipe...
pt: Salvando receita...

source: minute
pt: minuto

source: minutes
pt: minutos

source: hour
pt: hora

source: hours
pt: horas

source: day
pt: dia

source: days
pt: dias

# week_abbreviation
source: w
pt: s

source: week
pt: semana

source: weeks
pt: semanas

source: month
pt: mês

source: months
pt: meses

source: Open settings
pt: Abrir configurações

source: Settings
pt: Configurações

# configure_backup
source: Configure a backup to be able to recover all app data when you need it, choose a option below
pt: Configure um backup para poder recuperar todos os seus dados quando precisar, escolha uma opção abaixo

source: Generate local file
pt: Gerar arquivo local

source: Configured at
pt: Configurado em

source: Done at
pt: Feito em

# backup_at_format
source: MM/dd/yyyy HH:mm
pt: dd/MM/yyyy HH:mm

# updated_at_format
source: MM/dd HH:mm
pt: dd/MM HH:mm

# last_used_format
source: MM/dd/yy
pt: dd/MM/yy

# menu_planning_date_format
source: MM/dd/yy
pt: dd/MM/yy

source: Account
pt: Conta

source: Do Backup
pt: Fazer Backup

source: Generate Backup File
pt: Gerar Arquivo Backup

source: Import local file
pt: Importar arquivo local

# not_possible_to_read_file
source: Not possible to read choosen file
pt: Não foi possível ler o arquivo escolhido

# wrong_file_extension_for_backup
source: Wrong file extension, should be .db
pt: Extensão do arquivo errada, deve ser .db

source: File successfully imported
pt: Arquivo importado com sucesso

# pending_click_below_to_retry
source: pending, click below to retry the proccess now
pt: pendente, clique abaixo para retentar o processo agora

# backup_error_occurred
source: error, an error happened when doing your backup, more details below.
pt: erro, aconteceu um erro ao fazer o seu backup, mas detalhes abaixo.

source: Doing backup...
pt: Fazendo backup...

# google_user_not_authenticated
source: User not authenticated
pt: Usuário não autenticado

source: Backup conflict
pt: Conflito no backup

# backup_conflict_explanation
source: The local backup file has a different version from the remote:
pt: O arquivo de backup local tem uma versão diferente do remoto:

# backup_conflict_details
source: %d recipe(s), last updated at: %s
pt: %d receita(s), última atualização: %s

# backup_conflict_choose
source: Choose a option below:
pt: Escolha uma das opções abaixo:

source: use local version
pt: usar versão local

source: use remote version
pt: usar versão remota

# confirm_local_version
source: Do you want to use the local version and erase the remote version?
pt: Deseja utilizar a versão local e apagar a versão remota?

# confirm_remote_version
source: Do you want to use the remote version and erase the local version
pt: Deseja utilizar a versão remota e apagar a versão local?

# confirm_version_title
source: Use %s
pt: Usar %s

source: local version
pt: versão local

# remote_version
source: remota version
pt: versão remota

source: confirm
pt: confirmar

source: cancel
pt: cancelar

source: Adding recipe...
pt: Adicionando receita...

source: copy to clipboard
pt: copiar para área de transferência

source: share
pt: compartilhar

source: add to grocery list
pt: adicionar à lista de compras

source: Error when adding to grocery list
pt: Erro ao adicionar à lista de compras

source: Recipe already added to grocery list
pt: Receita já foi adiciona à lista de compras

# recipe_added_to_grocery_list
source: Recipe already added to grocery list
pt: Receita adiciona à lista de compras

source: Choose a grocery list
pt: Escolha uma lista de compras

source: create a new grocery list
pt: criar uma nova lista de compras

source: Recipe portions
pt: Porções da receita

# type_in_recipe_portions_to_make
source: Type in how many portions you want to make with this recipe
pt: Digite quantas porções quer fazer com essa receita

# grocery_list_title
source: %dº week %s
pt: %dº semana %s

source: Edit Grocery List
pt: Editar Lista de Compras

# generic_error_save_grocery_list
source: An error occurred when saving grocery list
pt: Um erro aconteceu ao salvar lista de compras

source: checked items
pt: itens marcados

source: checked item
pt: item marcado

source: close
pt: fechar

source: Item recipes
pt: Receitas do item

# updated_at_date
source: Updated at %s
pt: Atualizado em %s

source: Archive Grocery List
pt: Arquivar Lista de Compras

source: Copy all items
pt: Copiar todos os itens

# archive_grocery_list_explanation
source: Do you really want to archive this grocery list?
pt: Deseja realmente arquivar essa lista de compras?

source: unit
pt: unidade

source: units
pt: unidades

source: coffe spoon
pt: colher de café

source: coffe spoons
pt: colheres de café

source: tea spoon
pt: colher de chá

source: tea spoons
pt: colheres de chá

source: desert spoon
pt: colher de sobremesa

source: desert spoons
pt: colheres de sobremesa

source: table spoon
pt: colher de sopa

source: table spoons
pt: colheres de sopa

source: cup
pt: xícara

source: cups
pt: xícaras

source: liter
pt: litro

source: liters
pt: litros

source: quart
pt: quarto

source: quarts
pt: quartos

source: gallon
pt: galão

source: gallons
pt: galões

source: ounce
pt: onça

source: ounces
pt: onças

source: pound
pt: libra

source: pounds
pt: libras

source: gram
pt: grama

source: grams
pt: gramas

source: kilogram
pt: quilo

source: kilograms
pt: quilos

# no_relevant_info_for_you
source: No relevant information for you
pt: Nenhuma informação relevante para você

# new_menu_planning_question
source: New menu planning?
pt: Novo planejamento de cardápio?

# first_menu_planning_explanation
source: Click below to do your first menu planning and organize your meals.
pt: Clique abaixo para fazer seu primeiro planejamento de cardápio para organizar suas refeições.

# old_menu_plannings
source: Old plannings
pt: Planejamento antigos

# see_menu_planning_history_explanation
source: Click below to see menu planning history.
pt: Clique abaixo para visualizar o histórico de planejamentos de cardápio.

source: see history
pt: ver histórico

source: create new
pt: criar novo

source: Current menu planning
pt: Planejamento de cardápio atual

source: Next menu planning
pt: Próximo planejamento de cardápio

source: see details
pt: ver detalhes

source: Notes
pt: Anotações

source: make notes
pt: fazer anotações

# instructions_edit_note
source: Put here reminders for a recipe... Next recipes to do... Anything to help in your planning
pt: Anote aqui lembretes de uma receita... Próximas receitas a fazer... Qualquer coisa para lhe ajudar o seu planejamento

source: see recipe
pt: ver receita

source: New arround here?
pt: Novo por aqui?

# recipe_tutorial_explanation
source: Click in the tutorial below to find out how to add a recipe, your first steps.
pt: Clique no tutorial abaixo para descobrir como adicionar uma receita e dar os primeiros passos.

# no_backup_yet
source: Do not have a backup yet?
pt: Não configurou seu backup ainda?

# configure_backup_explanation
source: For your safety to ensure all your data is saved, and if anything happens to your device, you can recover your data. Configure a backup in the action below.
pt: Para você ter a segurança de que todos os seus dados estarão sempre salvos, e caso qualquer coisa aconteça com o seu dispositivo, você sempre poderá recuperar seus dados. Configure um backup na ação abaixo.

# configure_backup_action
source: configure backup
pt: configurar backup

source: Last grocery list used
pt: Última lista usada

source: Turn off inactivity suspension
pt: Desligar suspensão por inatividade

source: Turn on inactivity suspension
pt: Ligar suspensão por inatividade

source: Paste multiple ingredients
pt: Colar múltiplos ingredientes

source: newest
pt: mais novas

source: oldest
pt: mais antigas

source: recently used
pt: usadas recentemente

source: used a long time
pt: usadas faz tempo

source: faster
pt: mais rápidas

source: slower
pt: mais lentas

source: title A - Z
pt: nome A - Z

source: title Z- A
pt: nome Z- A

source: Sort by
pt: Ordernar por

source: clean
pt: limpar

source: Grocery list recipes
pt: Receitas da lista

source: edit
pt: editar

# preparation_in_minutes
source: Preparation (%s)
pt: Preparo (%s)

# preparation_time_hint
source: How much time of preparation
pt: Quanto tempo de preparo

# cooking_in_minutes
source: Cookin (%s)
pt: Cozimento (%s)

# cooking_time_hint
source: How much time of cooking
pt: Quanto tempo de cozimento

# oven_in_minutes
source: Oven (%s)
pt: Forno (%s)

# oven_time_hint
source: How much time of oven
pt: Quanto tempo de forno

# marinate_in_minutes
source: Marinate (%s)
pt: Marinada (%s)

# marinate_time_hint
source: How much time of marinate
pt: Quanto tempo de marinada ou molho

# fridge_in_minutes
source: Fridge (%s)
pt: Geladeira (%s)

# fridge_time_hint
source: How much time of fridge
pt: Quanto tempo de geladeira

# freezer_time_hint
source: How much time of freezer
pt: Quanto tempo de freezer

# preparation_time_details_explanation
source: Detail all recipe times in categories to know exactly how much time is spent in every step
pt: Detalhe todos os tempos da receita em categorias para saber exatamente quanto tempo em cada etapa do preparo será gasto

# edit_preparation_time_in
source: Edite times in:
pt: Editar os tempos em:

source: preparation
pt: preparo

source: cooking
pt: cozimento

source: oven
pt: forno

source: marinate
pt: marinada

source: fridge
pt: geladeira

source: Insert category
pt: Inserir categoria

source: New category
pt: Nova categoria

source: List recipes
pt: Receitas da lista

# tutorial_create_recipe_title
source: How to add a recipe
pt: Como adicionar uma receita

# tutorial_create_recipe_explanation_1
source: 1 - Click in the option 'Recipes' in bottom bar 2 - Click on '+'
pt: Clique na opção 'Receitas' na barra inferior, em seguida clique no botão '+'

# tutorial_create_recipe_explanation_2
source: Fill all recipes informations, like: name, portions, preparation time, ingredients e instructions
pt: Preencha todas as informações da receita, como: nome, porções, tempo de preparo, ingredientes e instruções

# tutorial_create_recipe_explanation_3
source: With all filled just click on ✔ and the recipe will be saved
pt: Com tudo preenchido só clicar no botão ✔ e a receita será salva

source: exit
pt: sair

source: previous
pt: anterior

source: next
pt: próximo

source: Fill this required field
pt: Preencha este campo obrigatório
